bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
#ifndef BENOS_H
#define BENOS_H

#include <Arduino.h>
#include <TFT_eSPI.h>
#include <SD.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <time.h>
#include <TJpg_Decoder.h>
//#include <DNSServer.h>  
#include <WiFiUdp.h> 
#include <ESP32Ping.h>


// Pin definitions from main (these are #defines, not variables)
// PIN_TRA, PIN_TRB, PIN_KO are already defined in main .ino
extern volatile int rotaryPos;

// Audio functions from main
extern void playSound(const char *path, bool stopCurrent);
extern void updateAudio();
extern void stopAudio();

// ========== CONFIG ==========
namespace BenOS_Config {
    const char* OS_VERSION = "BenOS v1.0";
    const char* WIFI_SSID = "INDIGO";  // ← CHANGE THIS
    const char* WIFI_PASS = "redsun1234";  // ← CHANGE THIS
    const char* NTP_SERVER = "pool.ntp.org";
    const long GMT_OFFSET = -5 * 3600;  // EST (adjust for your timezone)
    const int DAYLIGHT_OFFSET = 0;
}
/*
// ========== DNS SERVER GLOBALS ==========
DNSServer* benOS_dnsServer = nullptr;
bool benOS_dnsServerRunning = false;
const byte DNS_PORT = 53;
IPAddress benOS_apIP(192, 168, 4, 1);

struct DNSOverride {
    String hostname;
    IPAddress ip;
};

#define MAX_DNS_OVERRIDES 50
DNSOverride benOS_dnsOverrides[MAX_DNS_OVERRIDES];
int benOS_numDNSOverrides = 0;
*/
// ========== THEMES ==========
struct BenOS_Theme {
    uint16_t bg;
    uint16_t fg;
    const char* name;
};

BenOS_Theme benOS_themes[] = {
    {TFT_BLACK, TFT_GREEN, "matrix"},
    {TFT_BLACK, TFT_CYAN, "cyan"},
    {TFT_BLACK, TFT_WHITE, "classic"},
    {TFT_BLUE, TFT_YELLOW, "blue"},
    {TFT_WHITE, TFT_BLACK, "light"},
    {0x0014, TFT_ORANGE, "dark-orange"},
    {0x2104, TFT_MAGENTA, "purple"},
    {0x6a51, TFT_RED, "red-night"}
};

int benOS_currentTheme = 0;
const int benOS_themeCount = sizeof(benOS_themes) / sizeof(BenOS_Theme);

// ========== COMMAND MENU MEMORY ==========
int benOS_lastSelectedCommand = 0;

// ========== WEB COMMAND QUEUE ==========
#define MAX_WEB_COMMANDS 5
String benOS_webCommandQueue[MAX_WEB_COMMANDS];
int benOS_webCommandCount = 0;

// ========== WEB OUTPUT BUFFER ==========
String benOS_webCommandOutput = "";
bool benOS_webCommandDone = false;

// ========== FORWARD DECLARATIONS (EARLY) ==========
void benOS_processWebServer();

// ========== DISPLAY BUFFER ==========
#define BENOS_MAX_LINES 20
#define BENOS_LINE_HEIGHT 16
String benOS_displayBuffer[BENOS_MAX_LINES];
int benOS_scrollOffset = 0;
int benOS_totalLines = 0;

// ========== HELPER FUNCTIONS ==========

void benOS_applyTheme(TFT_eSPI &tft) {
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
}

void benOS_clearScreen(TFT_eSPI &tft) {
    benOS_applyTheme(tft);
    benOS_scrollOffset = 0;
    benOS_totalLines = 0;
    for (int i = 0; i < BENOS_MAX_LINES; i++) {
        benOS_displayBuffer[i] = "";
    }
}

void benOS_addLine(String line) {
    if (benOS_totalLines < BENOS_MAX_LINES) {
        benOS_displayBuffer[benOS_totalLines++] = line;
    } else {
        // Scroll up
        for (int i = 0; i < BENOS_MAX_LINES - 1; i++) {
            benOS_displayBuffer[i] = benOS_displayBuffer[i + 1];
        }
        benOS_displayBuffer[BENOS_MAX_LINES - 1] = line;
    }
    Serial.println(line);
}

void benOS_addLineWrapped(String line) {
    const int maxChars = 40;  // Max chars per line for font size 2
    
    if (line.length() <= maxChars) {
        benOS_addLine(line);
        return;
    }
    
    // Break into multiple lines
    int start = 0;
    while (start < line.length()) {
        int end = start + maxChars;
        if (end > line.length()) {
            end = line.length();
        }
        benOS_addLine(line.substring(start, end));
        start = end;
    }
}

void benOS_redrawScreen(TFT_eSPI &tft) {
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    tft.setTextFont(2);
    tft.setTextDatum(TL_DATUM);
    
    int y = 2;
    int startLine = max(0, benOS_totalLines - 14);
    
    for (int i = startLine; i < benOS_totalLines; i++) {
        tft.drawString(benOS_displayBuffer[i].substring(0, 40), 2, y);
        y += BENOS_LINE_HEIGHT;
        if (y > 228) break;
    }
}

// ========== NETWORK FUNCTIONS ==========

void benOS_connectWiFi(TFT_eSPI &tft) {
    if (WiFi.status() == WL_CONNECTED) {
        benOS_addLine("Already connected.");
        benOS_redrawScreen(tft);
        return;
    }
    
    benOS_addLine("Connecting to WiFi...");
    benOS_redrawScreen(tft);
    
    WiFi.begin(BenOS_Config::WIFI_SSID, BenOS_Config::WIFI_PASS);
    int attempts = 0;
    
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
        delay(500);
        attempts++;
    }
    
    if (WiFi.status() == WL_CONNECTED) {
        benOS_addLine("Connected!");
        benOS_addLine("IP: " + WiFi.localIP().toString());
    } else {
        benOS_addLine("Failed to connect.");
    }
    benOS_redrawScreen(tft);
}

// ========== AUTO-CONNECT WIFI HELPER ==========
bool benOS_ensureWiFi(TFT_eSPI &tft) {
    if (WiFi.status() == WL_CONNECTED) {
        return true;  // Already connected
    }
    
    benOS_clearScreen(tft);
    benOS_addLine("WiFi Required");
    benOS_addLine("Connecting...");
    benOS_redrawScreen(tft);
    
    WiFi.begin(BenOS_Config::WIFI_SSID, BenOS_Config::WIFI_PASS);
    int attempts = 0;
    
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
        delay(500);
        attempts++;
    }
    
    if (WiFi.status() == WL_CONNECTED) {
        benOS_addLine("Connected!");
        benOS_addLine("IP: " + WiFi.localIP().toString());
        benOS_redrawScreen(tft);
        delay(1000);
        return true;
    } else {
        benOS_addLine("Connection failed!");
        benOS_redrawScreen(tft);
        delay(2000);
        return false;
    }
}


// ========== DNS FORWARDING SERVER (UDP-based) ==========

WiFiUDP benOS_dnsUdp;
WiFiUDP benOS_forwardUdp;
bool benOS_dnsServerRunning = false;
const int DNS_PORT = 53;
IPAddress benOS_apIP(192, 168, 4, 1);
IPAddress benOS_dnsForwarder(8, 8, 8, 8);  // Google DNS

struct DNSOverride {
    String hostname;
    IPAddress ip;
};

