bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
#define MAX_DNS_OVERRIDES 50
DNSOverride benOS_dnsOverrides[MAX_DNS_OVERRIDES];
int benOS_numDNSOverrides = 0;

// DNS packet structure helpers
String benOS_parseDNSQuery(byte* buffer, int length) {
    if (length < 12) return "";
    
    String hostname = "";
    int pos = 12;  // Skip DNS header
    
    while (pos < length && buffer[pos] != 0) {
        int labelLen = buffer[pos];
        if (labelLen == 0 || labelLen > 63) break;  // Invalid label
        
        pos++;
        for (int i = 0; i < labelLen && pos < length; i++) {
            char c = buffer[pos++];
            // Convert to lowercase immediately
            if (c >= 'A' && c <= 'Z') {
                c = c + 32;
            }
            hostname += c;
        }
        
        if (buffer[pos] != 0 && pos < length) {
            hostname += ".";
        }
    }
    
    // Remove any trailing dot
    if (hostname.endsWith(".")) {
        hostname = hostname.substring(0, hostname.length() - 1);
    }
    
    return hostname;
}

void benOS_createDNSResponse(byte* query, int queryLen, byte* response, int &responseLen, IPAddress ip) {
    // Copy query to response
    memcpy(response, query, queryLen);
    
    // Set flags: response, no error
    response[2] = 0x81;
    response[3] = 0x80;
    
    // Set answer count to 1
    response[6] = 0x00;
    response[7] = 0x01;
    
    // Add answer section
    int pos = queryLen;
    
    // Name pointer to question
    response[pos++] = 0xC0;
    response[pos++] = 0x0C;
    
    // Type A
    response[pos++] = 0x00;
    response[pos++] = 0x01;
    
    // Class IN
    response[pos++] = 0x00;
    response[pos++] = 0x01;
    
    // TTL (300 seconds)
    response[pos++] = 0x00;
    response[pos++] = 0x00;
    response[pos++] = 0x01;
    response[pos++] = 0x2C;
    
    // Data length (4 bytes for IPv4)
    response[pos++] = 0x00;
    response[pos++] = 0x04;
    
    // IP address
    response[pos++] = ip[0];
    response[pos++] = ip[1];
    response[pos++] = ip[2];
    response[pos++] = ip[3];
    
    responseLen = pos;
}

void benOS_loadDNSOverrides() {
    benOS_numDNSOverrides = 0;
    
    if (!SD.exists("/dns_records.txt")) {
        Serial.println("No dns_records.txt found");
        return;
    }
    
    File f = SD.open("/dns_records.txt");
    if (!f) {
        Serial.println("Failed to open dns_records.txt");
        return;
    }
    
    Serial.println("=== Loading DNS overrides ===");
    
    while (f.available() && benOS_numDNSOverrides < MAX_DNS_OVERRIDES) {
        String line = f.readStringUntil('\n');
        line.trim();
        
        if (line.length() == 0 || line.startsWith("#")) {
            continue;
        }
        
        int eqPos = line.indexOf('=');
        if (eqPos > 0) {
            String hostname = line.substring(0, eqPos);
            String ipStr = line.substring(eqPos + 1);
            
            hostname.trim();
            ipStr.trim();
            hostname.toLowerCase();
            
            IPAddress ip;
            if (ip.fromString(ipStr)) {
                benOS_dnsOverrides[benOS_numDNSOverrides].hostname = hostname;
                benOS_dnsOverrides[benOS_numDNSOverrides].ip = ip;
                
                Serial.print("  [");
                Serial.print(benOS_numDNSOverrides);
                Serial.print("] '");
                Serial.print(hostname);
                Serial.print("' -> ");
                Serial.println(ip.toString());
                
                benOS_numDNSOverrides++;
            } else {
                Serial.print("  Invalid IP in line: ");
                Serial.println(line);
            }
        }
    }
    
    f.close();
    Serial.print("=== Loaded ");
    Serial.print(benOS_numDNSOverrides);
    Serial.println(" overrides ===");
}

bool benOS_getDNSOverride(String hostname, IPAddress &result) {
    hostname.toLowerCase();
    hostname.trim();
    
    // Remove trailing dot if present
    if (hostname.endsWith(".")) {
        hostname = hostname.substring(0, hostname.length() - 1);
    }
    
    Serial.print("Checking override for: '");
    Serial.print(hostname);
    Serial.println("'");
    
    for (int i = 0; i < benOS_numDNSOverrides; i++) {
        String overrideHost = benOS_dnsOverrides[i].hostname;
        overrideHost.toLowerCase();
        overrideHost.trim();
        
        Serial.print("  Comparing with: '");
        Serial.print(overrideHost);
        Serial.print("' ... ");
        
        if (hostname == overrideHost) {
            result = benOS_dnsOverrides[i].ip;
            Serial.print("MATCH! ");
            Serial.print(hostname);
            Serial.print(" -> ");
            Serial.println(result.toString());
            return true;
        }
        Serial.println("no match");
    }
    
    Serial.println("  No override found, will forward");
    return false;
}

void benOS_processDNSRequest() {
    if (!benOS_dnsServerRunning) return;
    
    int packetSize = benOS_dnsUdp.parsePacket();
    if (packetSize) {
        byte query[512];
        int len = benOS_dnsUdp.read(query, 512);
        
        IPAddress remoteIP = benOS_dnsUdp.remoteIP();
        int remotePort = benOS_dnsUdp.remotePort();
        
        String hostname = benOS_parseDNSQuery(query, len);
        
        Serial.print("DNS Query from ");
        Serial.print(remoteIP.toString());
        Serial.print(": ");
        Serial.println(hostname);
        
        IPAddress resultIP;
        
        // Check overrides first
        if (benOS_getDNSOverride(hostname, resultIP)) {
            // Send override response
            byte response[512];
            int responseLen = 0;
            benOS_createDNSResponse(query, len, response, responseLen, resultIP);
            
            benOS_dnsUdp.beginPacket(remoteIP, remotePort);
            benOS_dnsUdp.write(response, responseLen);
            benOS_dnsUdp.endPacket();
            
            Serial.println("  Sent override response");
        } else {
            // Forward to real DNS server
            Serial.println("  Forwarding to 8.8.8.8");
            
            benOS_forwardUdp.beginPacket(benOS_dnsForwarder, 53);
            benOS_forwardUdp.write(query, len);
            benOS_forwardUdp.endPacket();
            
            // Wait for response (with timeout)
            unsigned long startTime = millis();
            while (millis() - startTime < 2000) {
                int forwardPacketSize = benOS_forwardUdp.parsePacket();
                if (forwardPacketSize) {
                    byte response[512];
                    int responseLen = benOS_forwardUdp.read(response, 512);
                    
