bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
String benOS_getTime() {
    time_t now = time(nullptr);
    if (now < 100000) return "Time not synced";
    
    struct tm* t = localtime(&now);
    char buf[40];
    sprintf(buf, "%04d-%02d-%02d %02d:%02d:%02d",
            t->tm_year + 1900, t->tm_mon + 1, t->tm_mday,
            t->tm_hour, t->tm_min, t->tm_sec);
    return String(buf);
}

// ========== DIG HOSTNAME SELECTION MENU ==========

struct HostnameExample {
    const char* name;
    const char* hostname;
};

HostnameExample benOS_hostnameExamples[] = {
    {"Google", "google.com"},
    {"Yahoo", "yahoo.com"},
    {"GitHub", "github.com"},
    {"Amazon", "amazon.com"},
    {"Wikipedia", "wikipedia.org"},
    {"Reddit", "reddit.com"},
    {"Stack Overflow", "stackoverflow.com"},
    {"Twitter/X", "twitter.com"},
    {"YouTube", "youtube.com"},
    {"Facebook", "facebook.com"},
    {"Netflix", "netflix.com"},
    {"OpenAI", "openai.com"},
    {"ESPN", "espn.com"},
    {"CNN", "cnn.com"},
    {"BBC", "bbc.com"},
    {"Custom hostname...", ""}  // Last option for manual entry
};

const int benOS_numHostnameExamples = sizeof(benOS_hostnameExamples) / sizeof(HostnameExample);

String benOS_hostnameInput(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
            tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
            
            // Title
            tft.setTextFont(2);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("Select Hostname", 160, 5);
            
            // Show 9 items at a time
            int startIdx = selected - 4;
            if (startIdx < 0) startIdx = 0;
            if (startIdx > benOS_numHostnameExamples - 9) startIdx = benOS_numHostnameExamples - 9;
            if (benOS_numHostnameExamples < 9) startIdx = 0;
            
            tft.setTextFont(2);
            tft.setTextDatum(CL_DATUM);
            
            for (int i = 0; i < 9 && (startIdx + i) < benOS_numHostnameExamples; i++) {
                int idx = startIdx + i;
                int y = 30 + i * 23;
                
                if (idx == selected) {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].bg, benOS_themes[benOS_currentTheme].fg);
                    tft.fillRect(2, y - 2, 316, 20, benOS_themes[benOS_currentTheme].fg);
                } else {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                }
                
                // Show name and hostname
                String display = benOS_hostnameExamples[idx].name;
                if (strlen(benOS_hostnameExamples[idx].hostname) > 0) {
                    display += " (" + String(benOS_hostnameExamples[idx].hostname) + ")";
                }
                tft.drawString(display.substring(0, 38), 6, y + 9);
            }
            
            lastSelected = selected;
        }
        
        // Handle rotary
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= benOS_numHostnameExamples) selected = benOS_numHostnameExamples - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        // Handle button
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // If "Custom hostname..." selected, prompt for manual entry
            if (selected == benOS_numHostnameExamples - 1) {
                // Custom hostname entry screen
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(TC_DATUM);
                tft.drawString("Enter Custom Hostname", 160, 10);
                
                tft.setTextDatum(TL_DATUM);
                tft.drawString("Use Serial Monitor", 10, 50);
                tft.drawString("Example: example.com", 10, 70);
                tft.drawString("Or press button to cancel", 10, 90);
                
                String input = "";
                unsigned long startTime = millis();
                int lastBtnInner = HIGH;
                
                while (millis() - startTime < 20000) {  // 20 second timeout
                    while (Serial.available()) {
                        char c = Serial.read();
                        if (c == '\n' || c == '\r') {
                            if (input.length() > 0) return input;
                        } else {
                            input += c;
                            tft.fillRect(10, 120, 300, 30, benOS_themes[benOS_currentTheme].bg);
                            tft.drawString(input.substring(0, 38), 10, 120);
                        }
                    }
                    
                    int btnInner = digitalRead(PIN_KO);
                    if (btnInner == LOW && lastBtnInner == HIGH) {
                        return "";  // Cancel
                    }
                    lastBtnInner = btnInner;
                    delay(50);
                }
                
                return "";  // Timeout
            } else {
                // Return selected hostname
                return String(benOS_hostnameExamples[selected].hostname);
            }
        }
        lastBtn = btn;
        
        delay(50);
    }
}

// ========== DIG COMMAND (DNS LOOKUP) WITH PAGINATION ==========

void benOS_dig(TFT_eSPI &tft, String hostname) {
    // WiFi check removed - handled by caller
    
    benOS_clearScreen(tft);
    benOS_addLine("DNS Lookup");
    benOS_addLine("========================");
    benOS_addLine("Query: " + hostname);
    benOS_addLine("");
    benOS_addLine("Resolving...");
    benOS_redrawScreen(tft);
    
