bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                return "";
            } else {
                return String(benOS_urlExamples[selected].url);
            }
        }
        lastBtn = btn;
        
        delay(50);
    }
}
// ========== PING COMMAND ==========

struct PingHost {
    const char* name;
    const char* host;
};

PingHost benOS_pingHosts[] = {
    {"Google DNS", "8.8.8.8"},
    {"Cloudflare DNS", "1.1.1.1"},
    {"Google", "google.com"},
    {"GitHub", "github.com"},
    {"Router", "192.168.1.1"},
    {"Custom...", ""}
};

const int benOS_numPingHosts = sizeof(benOS_pingHosts) / sizeof(PingHost);

String benOS_selectPingHost(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
            tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
            
            tft.setTextFont(2);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("Select Host to Ping", 160, 5);
            
            tft.setTextFont(2);
            tft.setTextDatum(CL_DATUM);
            
            for (int i = 0; i < benOS_numPingHosts; i++) {
                int y = 30 + i * 30;
                
                if (i == selected) {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].bg, benOS_themes[benOS_currentTheme].fg);
                    tft.fillRect(2, y - 2, 316, 26, benOS_themes[benOS_currentTheme].fg);
                } else {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                }
                
                String display = String(benOS_pingHosts[i].name);
                if (strlen(benOS_pingHosts[i].host) > 0) {
                    display += " - " + String(benOS_pingHosts[i].host);
                }
                tft.drawString(display.substring(0, 38), 6, y + 11);
            }
            
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= benOS_numPingHosts) selected = benOS_numPingHosts - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            if (selected == benOS_numPingHosts - 1) {
                return benOS_textInput(tft, "Enter host:");
            } else {
                return String(benOS_pingHosts[selected].host);
            }
        }
        lastBtn = btn;
        
        delay(50);
    }
}

void benOS_ping(TFT_eSPI &tft, String host) {
    benOS_clearScreen(tft);
    benOS_addLine("PING " + host);
    benOS_addLine("===================");
    benOS_redrawScreen(tft);
    
    IPAddress ip;
    if (!WiFi.hostByName(host.c_str(), ip)) {
        benOS_addLine("DNS lookup failed");
        benOS_redrawScreen(tft);
        return;
    }
    
    benOS_addLine("IP: " + ip.toString());
    benOS_addLine("");
    benOS_redrawScreen(tft);
    
    int sent = 0, received = 0;
    long totalTime = 0;
    
    for (int i = 0; i < 5; i++) {
        unsigned long start = millis();
        
        if (Ping.ping(ip, 1)) {
            long rtt = millis() - start;
            totalTime += rtt;
            received++;
            benOS_addLine("Reply: time=" + String(rtt) + "ms");
        } else {
            benOS_addLine("Request timeout");
        }
        
        sent++;
        benOS_redrawScreen(tft);
        delay(1000);
    }
    
    benOS_addLine("");
    benOS_addLine("--- Statistics ---");
    benOS_addLine("Sent: " + String(sent) + ", Received: " + String(received));
    
    if (received > 0) {
        benOS_addLine("Avg time: " + String(totalTime / received) + "ms");
        int loss = ((sent - received) * 100) / sent;
        benOS_addLine("Packet loss: " + String(loss) + "%");
    } else {
        benOS_addLine("100% packet loss");
    }
    
    benOS_redrawScreen(tft);
}

// ========== WIFI SCANNER ==========

void benOS_wifiScan(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("Scanning WiFi networks...");
    benOS_redrawScreen(tft);
    
    int n = WiFi.scanNetworks();
    
    benOS_clearScreen(tft);
    benOS_addLine("Found " + String(n) + " networks");
    benOS_addLine("===================");
    
    int displayed = 0;
    int page = 0;
    const int perPage = 4;  // Show 4 networks per page
    
    while (displayed < n) {
        benOS_clearScreen(tft);
        benOS_addLine("WiFi Networks (Page " + String(page + 1) + ")");
        benOS_addLine("===================");
        benOS_addLine("");
        
        for (int i = 0; i < perPage && displayed < n; i++, displayed++) {
            String ssid = WiFi.SSID(displayed);
            int rssi = WiFi.RSSI(displayed);
            String encType = (WiFi.encryptionType(displayed) == WIFI_AUTH_OPEN) ? " " : "*";
            
            // Signal strength bars
            String bars = "";
            if (rssi > -50) bars = "[====]";
            else if (rssi > -60) bars = "[=== ]";
            else if (rssi > -70) bars = "[==  ]";
            else if (rssi > -80) bars = "[=   ]";
            else bars = "[    ]";
            
            benOS_addLine(String(displayed+1) + "." + encType + " " + ssid.substring(0, 18));
            benOS_addLine("   " + String(rssi) + "dBm " + bars + " Ch" + String(WiFi.channel(displayed)));
        }
        
        benOS_addLine("");
        if (displayed < n) {
            benOS_addLine("(" + String(n - displayed) + " more networks)");
            benOS_addLine("Press button for next page");
        } else {
            benOS_addLine("--- End of list ---");
            benOS_addLine("Press button to continue");
        }
        
        benOS_redrawScreen(tft);
        
        // Wait for button press
        while (digitalRead(PIN_KO) == LOW) delay(10);
        delay(200);
        int lastBtn = HIGH;
        while (true) {
            int btn = digitalRead(PIN_KO);
            if (btn == LOW && lastBtn == HIGH) break;
            lastBtn = btn;
            delay(50);
        }
        while (digitalRead(PIN_KO) == LOW) delay(10);
        delay(200);
        
        page++;
    }
    
