bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
// ========== QR CODE GENERATOR ==========

void benOS_drawQRPixel(TFT_eSPI &tft, int x, int y, int scale, bool black) {
    if (black) {
        tft.fillRect(x, y, scale, scale, TFT_BLACK);
    } else {
        tft.fillRect(x, y, scale, scale, TFT_WHITE);
    }
}

void benOS_qrcode(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    const char* qrOptions[] = {
        "WiFi Credentials",
        "BenOS GitHub",
        "Custom Text"
    };
    const int numOptions = 3;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("QR Code Generator");
            benOS_addLine("===================");
            benOS_addLine("");
            benOS_addLine("Select content:");
            
            for (int i = 0; i < numOptions; i++) {
                String line = "  " + String(qrOptions[i]);
                if (i == selected) line = "> " + String(qrOptions[i]);
                benOS_addLine(line);
            }
            
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= numOptions) selected = numOptions - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            String qrText = "";
            
            if (selected == 0) {
                // WiFi credentials in QR format
                qrText = "WIFI:T:WPA;S:" + String(BenOS_Config::WIFI_SSID) + 
                         ";P:" + String(BenOS_Config::WIFI_PASS) + ";;";
            } else if (selected == 1) {
                qrText = "https://github.com/yourusername/BenOS";
            } else {
                qrText = benOS_textInput(tft, "Enter text for QR:");
                if (qrText.length() == 0) return;
            }
            
            // Display simple representation (actual QR requires library)
            tft.fillScreen(TFT_WHITE);
            tft.setTextColor(TFT_BLACK, TFT_WHITE);
            tft.setTextFont(2);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("QR Code", 160, 10);
            
            // Draw placeholder QR pattern
            int qrSize = 160;
            int startX = (320 - qrSize) / 2;
            int startY = 40;
            
            tft.fillRect(startX, startY, qrSize, qrSize, TFT_WHITE);
            tft.drawRect(startX, startY, qrSize, qrSize, TFT_BLACK);
            
            // Draw corners (position markers)
            int cornerSize = 30;
            // Top-left
            tft.fillRect(startX + 10, startY + 10, cornerSize, cornerSize, TFT_BLACK);
            tft.fillRect(startX + 15, startY + 15, cornerSize - 10, cornerSize - 10, TFT_WHITE);
            tft.fillRect(startX + 20, startY + 20, cornerSize - 20, cornerSize - 20, TFT_BLACK);
            
            // Top-right
            tft.fillRect(startX + qrSize - cornerSize - 10, startY + 10, cornerSize, cornerSize, TFT_BLACK);
            tft.fillRect(startX + qrSize - cornerSize - 5, startY + 15, cornerSize - 10, cornerSize - 10, TFT_WHITE);
            tft.fillRect(startX + qrSize - cornerSize, startY + 20, cornerSize - 20, cornerSize - 20, TFT_BLACK);
            
            // Bottom-left
            tft.fillRect(startX + 10, startY + qrSize - cornerSize - 10, cornerSize, cornerSize, TFT_BLACK);
            tft.fillRect(startX + 15, startY + qrSize - cornerSize - 5, cornerSize - 10, cornerSize - 10, TFT_WHITE);
            tft.fillRect(startX + 20, startY + qrSize - cornerSize, cornerSize - 20, cornerSize - 20, TFT_BLACK);
            
            // Random pattern in middle (placeholder)
            for (int i = 0; i < 100; i++) {
                int x = startX + random(50, qrSize - 50);
                int y = startY + random(50, qrSize - 50);
                tft.fillRect(x, y, 4, 4, TFT_BLACK);
            }
            
            tft.setTextDatum(BC_DATUM);
            tft.drawString("Scan this code", 160, 210);
            tft.drawString("Press button to return", 160, 230);
            
            Serial.println("QR Code content: " + qrText);
            
            // Wait for button
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            lastBtn = HIGH;
            while (true) {
                int btn = digitalRead(PIN_KO);
                if (btn == LOW && lastBtn == HIGH) break;
                lastBtn = btn;
                delay(50);
            }
            
            return;
        }
        lastBtn = btn;
        delay(50);
    }
}

// ========== ASCII ART VIEWER ==========

void benOS_ascii(TFT_eSPI &tft) {
    // List ASCII files from SD
    File root = SD.open("/ascii");
    if (!root || !root.isDirectory()) {
        benOS_clearScreen(tft);
        benOS_addLine("No /ascii folder found");
        benOS_addLine("Create /ascii/ on SD card");
        benOS_addLine("Add .txt files with ASCII art");
        benOS_redrawScreen(tft);
        return;
    }
    
    String files[20];
    int fileCount = 0;
    
    File file = root.openNextFile();
    while (file && fileCount < 20) {
        if (!file.isDirectory()) {
            String name = String(file.name());
            if (name.endsWith(".txt")) {
                files[fileCount++] = name;
            }
        }
        file = root.openNextFile();
    }
    
    if (fileCount == 0) {
        benOS_clearScreen(tft);
        benOS_addLine("No .txt files in /ascii/");
        benOS_redrawScreen(tft);
        return;
    }
    
    // Select file
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Select ASCII Art:");
            benOS_addLine("===================");
            
            for (int i = 0; i < min(fileCount, 12); i++) {
                String line = (i == selected) ? "> " : "  ";
                line += files[i];
                benOS_addLine(line.substring(0, 38));
            }
            
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
