bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= fileCount) selected = fileCount - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // Display selected file
            File artFile = SD.open("/ascii/" + files[selected]);
            if (artFile) {
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(1);
                tft.setCursor(0, 0);
                
                while (artFile.available()) {
                    String line = artFile.readStringUntil('\n');
                    tft.println(line);
                }
                
                artFile.close();
                
                // Wait for button
                while (digitalRead(PIN_KO) == LOW) delay(10);
                delay(200);
                lastBtn = HIGH;
                while (true) {
                    int btn = digitalRead(PIN_KO);
                    if (btn == LOW && lastBtn == HIGH) break;
                    lastBtn = btn;
                    delay(50);
                }
            }
            
            return;
        }
        lastBtn = btn;
        delay(50);
    }
}

// ========== COWSAY ==========

void benOS_cowsay(TFT_eSPI &tft) {
    String message = benOS_textInput(tft, "Cow says:");
    if (message.length() == 0) message = "Hello from BenOS!";
    
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    tft.setTextFont(1);
    tft.setCursor(10, 10);
    
    // Top border
    String border = " ";
    for (int i = 0; i < min((int)message.length() + 2, 50); i++) border += "_";
    tft.println(border);
    
    // Message
    tft.print("< ");
    tft.print(message.substring(0, 48));
    tft.println(" >");
    
    // Bottom border
    border = " ";
    for (int i = 0; i < min((int)message.length() + 2, 50); i++) border += "-";
    tft.println(border);
    
    // Cow
    tft.println("        \\   ^__^");
    tft.println("         \\  (oo)\\_______");
    tft.println("            (__)\\       )\\/\\");
    tft.println("                ||----w |");
    tft.println("                ||     ||");
    
    tft.setTextFont(2);
    tft.setTextDatum(BC_DATUM);
    tft.drawString("Press button to return", 160, 230);
    
    // Wait for button
    while (digitalRead(PIN_KO) == LOW) delay(10);
    delay(200);
    int lastBtn = HIGH;
    while (true) {
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) break;
        lastBtn = btn;
        delay(50);
    }
}

// ========== WEATHER ==========

void benOS_weather(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("Weather");
    benOS_addLine("Newton Highlands, MA");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Fetching...");
    benOS_redrawScreen(tft);
    
    // Newton Highlands, MA coordinates: 42.3370, -71.2092
    HTTPClient http;
    http.begin("http://api.open-meteo.com/v1/forecast?latitude=42.337&longitude=-71.209&current_weather=true&temperature_unit=fahrenheit&windspeed_unit=mph");
    http.setTimeout(10000);
    
    int code = http.GET();
    
    benOS_clearScreen(tft);
    benOS_addLine("Weather");
    benOS_addLine("Newton Highlands, MA");
    benOS_addLine("===================");
    benOS_addLine("");
    
    if (code == HTTP_CODE_OK) {
        String json = http.getString();
        
        Serial.println("Weather JSON response:");
        Serial.println(json);  // Debug output
        
        // Find current_weather object
        int currentWeatherIdx = json.indexOf("\"current_weather\":");
        if (currentWeatherIdx > 0) {
            String weatherData = json.substring(currentWeatherIdx);
            
            // Parse temperature (comes after "temperature":)
            int tempIdx = weatherData.indexOf("\"temperature\":");
            if (tempIdx > 0) {
                int tempStart = tempIdx + 14;
                int tempEnd = weatherData.indexOf(',', tempStart);
                if (tempEnd < 0) tempEnd = weatherData.indexOf('}', tempStart);
                String temp = weatherData.substring(tempStart, tempEnd);
                temp.trim();
                benOS_addLine("Temperature: " + temp + " F");
            }
            
            // Parse windspeed
            int windIdx = weatherData.indexOf("\"windspeed\":");
            if (windIdx > 0) {
                int windStart = windIdx + 12;
                int windEnd = weatherData.indexOf(',', windStart);
                if (windEnd < 0) windEnd = weatherData.indexOf('}', windStart);
                String wind = weatherData.substring(windStart, windEnd);
                wind.trim();
                benOS_addLine("Wind: " + wind + " mph");
            }
            
            // Parse weather code
            int codeIdx = weatherData.indexOf("\"weathercode\":");
            if (codeIdx > 0) {
                int codeStart = codeIdx + 14;
                int codeEnd = weatherData.indexOf(',', codeStart);
                if (codeEnd < 0) codeEnd = weatherData.indexOf('}', codeStart);
                String codeStr = weatherData.substring(codeStart, codeEnd);
                codeStr.trim();
                
                int weatherCode = codeStr.toInt();
                String condition = "Unknown";
                
                if (weatherCode == 0) condition = "Clear sky";
                else if (weatherCode <= 3) condition = "Partly cloudy";
                else if (weatherCode <= 48) condition = "Fog";
                else if (weatherCode <= 67) condition = "Rainy";
                else if (weatherCode <= 77) condition = "Snowy";
                else if (weatherCode <= 82) condition = "Rain showers";
                else if (weatherCode <= 86) condition = "Snow showers";
                else condition = "Thunderstorm";
                
