bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                benOS_addLine("Conditions: " + condition);
            }
            
            // Parse time
            int timeIdx = weatherData.indexOf("\"time\":\"");
            if (timeIdx > 0) {
                int timeStart = timeIdx + 8;
                int timeEnd = weatherData.indexOf("\"", timeStart);
                String timeStr = weatherData.substring(timeStart, timeEnd);
                benOS_addLine("");
                benOS_addLine("Updated: " + timeStr);
            }
        } else {
            benOS_addLine("Parse error");
        }
        
    } else {
        benOS_addLine("Failed to fetch weather");
        benOS_addLine("Error: " + String(code));
    }
    
    http.end();
    benOS_redrawScreen(tft);
}

// ========== STOCK MARKET ==========

void benOS_stocks(TFT_eSPI &tft) {
    // Auto-sync time if not synced
    if (time(nullptr) < 100000) {
        benOS_clearScreen(tft);
        benOS_addLine("Syncing time first...");
        benOS_redrawScreen(tft);
        
        configTime(BenOS_Config::GMT_OFFSET, BenOS_Config::DAYLIGHT_OFFSET, BenOS_Config::NTP_SERVER);
        int attempts = 0;
        while (time(nullptr) < 100000 && attempts < 20) {
            delay(500);
            attempts++;
        }
    }
    
    benOS_clearScreen(tft);
    benOS_addLine("Stock Market");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Fetching indices...");
    benOS_redrawScreen(tft);
    
    const char* symbols[] = {"^GSPC", "^IXIC", "^DJI"};  // S&P 500, NASDAQ, Dow Jones
    const char* names[] = {"S&P 500", "NASDAQ", "Dow Jones"};
    
    benOS_clearScreen(tft);
    benOS_addLine("Stock Market Indices");
    benOS_addLine("===================");
    benOS_addLine("");
    
    // Use WiFiClientSecure for HTTPS
    WiFiClientSecure *client = new WiFiClientSecure;
    if (client) {
        client->setInsecure();  // Skip certificate validation
        
        for (int i = 0; i < 3; i++) {
            HTTPClient http;
            
            String url = "https://query1.finance.yahoo.com/v8/finance/chart/";
            url += symbols[i];
            url += "?interval=1d&range=1d";
            
            Serial.println("Fetching: " + url);
            
            if (http.begin(*client, url)) {
                http.setTimeout(10000);
                http.addHeader("User-Agent", "Mozilla/5.0");
                
                int code = http.GET();
                Serial.println("Response code: " + String(code));
                
                if (code == HTTP_CODE_OK) {
                    String response = http.getString();
                    
                    // Parse price from JSON
                    int priceIdx = response.indexOf("\"regularMarketPrice\":");
                    if (priceIdx > 0) {
                        int priceStart = priceIdx + 21;
                        int priceEnd = response.indexOf(',', priceStart);
                        if (priceEnd < 0) priceEnd = response.indexOf('}', priceStart);
                        
                        String price = response.substring(priceStart, priceEnd);
                        price.trim();
                        
                        benOS_addLine(String(names[i]) + ":");
                        benOS_addLine("  " + price);
                    } else {
                        benOS_addLine(String(names[i]) + ": N/A");
                    }
                } else {
                    benOS_addLine(String(names[i]) + ": Error " + String(code));
                }
                
                http.end();
            } else {
                benOS_addLine(String(names[i]) + ": Connect failed");
            }
            
            benOS_redrawScreen(tft);
            delay(1000);
        }
        
        delete client;
    } else {
        benOS_addLine("SSL client failed");
    }
    
    benOS_addLine("");
    benOS_addLine("Updated: " + benOS_getTime());
    benOS_redrawScreen(tft);
}

// ========== NEWS HEADLINES ==========

void benOS_news(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("News Headlines");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Fetching...");
    benOS_redrawScreen(tft);
    
    HTTPClient http;
    // Using NewsAPI.org - you'll need to get a free API key
    // For demo, using a simple RSS-to-JSON service
    http.begin("http://api.rss2json.com/v1/api.json?rss_url=http://rss.cnn.com/rss/cnn_topstories.rss");
    http.setTimeout(10000);
    
    int code = http.GET();
    
    benOS_clearScreen(tft);
    benOS_addLine("Top News Headlines");
    benOS_addLine("===================");
    benOS_addLine("");
    
    if (code == HTTP_CODE_OK) {
        String json = http.getString();
        
        // Simple parsing for first 3 titles
        int titleCount = 0;
        int searchPos = 0;
        
        while (titleCount < 3 && searchPos < json.length()) {
            int titleIdx = json.indexOf("\"title\":\"", searchPos);
            if (titleIdx < 0) break;
            
            int titleStart = titleIdx + 9;
            int titleEnd = json.indexOf("\"", titleStart);
            
            if (titleEnd > titleStart) {
                String title = json.substring(titleStart, titleEnd);
                title.replace("\\u0027", "'");
                title.replace("\\\"", "\"");
                
                benOS_addLine(String(titleCount + 1) + ". " + title.substring(0, 35));
                if (title.length() > 35) {
                    benOS_addLine("   " + title.substring(35, min(70, (int)title.length())));
                }
                benOS_addLine("");
                
                titleCount++;
            }
            
            searchPos = titleEnd + 1;
        }
        
        if (titleCount == 0) {
            benOS_addLine("No headlines found");
        }
    } else {
        benOS_addLine("Failed to fetch news");
        benOS_addLine("Error: " + String(code));
    }
    
    http.end();
    benOS_redrawScreen(tft);
}

// ========== WEB SERVER ==========

WiFiServer* benOS_webServer = nullptr;
bool benOS_webServerRunning = false;

void benOS_webserver(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    const char* options[] = {"Start Server", "Stop Server", "Status"};
    const int numOptions = 3;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Web Server");
            benOS_addLine("===================");
            benOS_addLine("");
            benOS_addLine("Status: " + String(benOS_webServerRunning ? "Running" : "Stopped"));
            benOS_addLine("");
            
