bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
            for (int i = 0; i < numOptions; i++) {
                String line = (i == selected) ? "> " : "  ";
                line += options[i];
                benOS_addLine(line);
            }
            
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= numOptions) selected = numOptions - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            if (selected == 0 && !benOS_webServerRunning) {
                // Start server
                benOS_webServer = new WiFiServer(80);
                benOS_webServer->begin();
                benOS_webServerRunning = true;
                
                benOS_clearScreen(tft);
                benOS_addLine("Web Server Started");
                benOS_addLine("===================");
                benOS_addLine("");
                benOS_addLine("Access at:");
                benOS_addLine("http://" + WiFi.localIP().toString());
                benOS_addLine("");
                benOS_addLine("Serving files from /www/");
                benOS_addLine("");
                benOS_addLine("Running in background...");
                benOS_redrawScreen(tft);
                
                Serial.println("Web server started: http://" + WiFi.localIP().toString());
                return;
                
            } else if (selected == 1 && benOS_webServerRunning) {
                // Stop server
                if (benOS_webServer) {
                    benOS_webServer->stop();
                    delete benOS_webServer;
                    benOS_webServer = nullptr;
                }
                benOS_webServerRunning = false;
                
                benOS_clearScreen(tft);
                benOS_addLine("Web server stopped");
                benOS_redrawScreen(tft);
                delay(1000);
                return;
                
            } else if (selected == 2) {
                // Show status
                benOS_clearScreen(tft);
                benOS_addLine("Web Server Status");
                benOS_addLine("===================");
                benOS_addLine("");
                
                if (benOS_webServerRunning) {
                    benOS_addLine("Status: Running");
                    benOS_addLine("URL: http://" + WiFi.localIP().toString());
                    benOS_addLine("Port: 80");
                } else {
                    benOS_addLine("Status: Stopped");
                }
                
                benOS_redrawScreen(tft);
                delay(2000);
                return;
            }
        }
        lastBtn = btn;
        delay(50);
    }
}


// ========== FORWARD DECLARATIONS FOR WEB SERVER ==========
void benOS_processWebServer();
void serve404(WiFiClient &client);
void serveFile(WiFiClient &client, const char *path);
void serveStatus(WiFiClient &client);
void serveOutput(WiFiClient &client);
void serveCommand(WiFiClient &client, String path);
void serveDefaultPage(WiFiClient &client);


void serveOutput(WiFiClient &client) {
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: application/json");
    client.println("Access-Control-Allow-Origin: *");
    client.println("Connection: close");
    client.println();
    
    String json = "{";
    json += "\"done\":" + String(benOS_webCommandDone ? "true" : "false") + ",";
    json += "\"output\":\"";
    
    // Escape newlines and quotes for JSON
    String escapedOutput = benOS_webCommandOutput;
    escapedOutput.replace("\\", "\\\\");
    escapedOutput.replace("\"", "\\\"");
    escapedOutput.replace("\n", "\\n");
    
    json += escapedOutput;
    json += "\"}";
    
    client.println(json);
}

// ========== ENHANCED WEB SERVER WITH API ==========

void benOS_processWebServer() {
    if (!benOS_webServerRunning || !benOS_webServer) return;
    
    WiFiClient client = benOS_webServer->available();
    if (client) {
        Serial.println("Web client connected!");
        
        String request = "";
        String firstLine = "";
        unsigned long timeout = millis();
        
        while (client.connected() && millis() - timeout < 2000) {
            if (client.available()) {
                char c = client.read();
                request += c;
                
                if (firstLine == "" && c == '\n') {
                    int endOfLine = request.indexOf('\n');
                    if (endOfLine > 0) {
                        firstLine = request.substring(0, endOfLine);
                    }
                }
                
                if (c == '\n' && request.endsWith("\r\n\r\n")) {
                    break;
                }
            }
        }
        
        // Parse request path
        String path = "/";
        int pathStart = firstLine.indexOf("GET ") + 4;
        int pathEnd = firstLine.indexOf(" HTTP");
        if (pathStart > 3 && pathEnd > pathStart) {
            path = firstLine.substring(pathStart, pathEnd);
        }
        
        Serial.println("Web request: " + path);
        
// Route requests
if (path == "/" || path == "/index.html") {
    if (SD.exists("/www/index.html")) {
        serveFile(client, "/www/index.html");
    } else {
        serveDefaultPage(client);
    }
}
else if (path == "/api/status") {
    serveStatus(client);
}
else if (path == "/api/output") {  
    serveOutput(client);
}    
else if (path.startsWith("/api/command")) {
    serveCommand(client, path);
}
else if (path == "/api/reboot") {
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: text/plain");
    client.println("Connection: close");
    client.println();
    client.println("Rebooting...");
    client.stop();
    delay(1000);
    ESP.restart();
}
else {
    serve404(client);
}
        
        delay(10);
        client.stop();
        Serial.println("Client disconnected");
    }
}  // ← MAKE SURE THIS CLOSING BRACE IS HERE!

