bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
void serveDefaultPage(WiFiClient &client) {
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: text/html");
    client.println("Connection: close");
    client.println();
    
    client.println("<!DOCTYPE HTML>");
    client.println("<html>");
    client.println("<head>");
    client.println("<title>BenOS Control Panel</title>");
    client.println("<meta name='viewport' content='width=device-width, initial-scale=1'>");
    client.println("<style>");
    client.println("body { background: #000; color: #0f0; font-family: monospace; margin: 20px; }");
    client.println("h1 { color: #0f0; text-align: center; }");
    client.println(".box { border: 2px solid #0f0; padding: 15px; margin: 10px 0; }");
    client.println("button { background: #0f0; color: #000; border: none; padding: 10px 20px; margin: 5px; cursor: pointer; font-family: monospace; }");
    client.println("</style>");
    client.println("</head>");
    client.println("<body>");
    client.println("<h1>BenOS Control Panel</h1>");
    client.println("<div class='box'>");
    client.println("<h2>System Status</h2>");
    client.println("<p>Uptime: " + String(millis() / 1000) + " seconds</p>");
    client.println("<p>Free Memory: " + String(ESP.getFreeHeap() / 1024) + " KB</p>");
    client.println("<p>IP: " + WiFi.localIP().toString() + "</p>");
    client.println("</div>");
    client.println("</body>");
    client.println("</html>");
}

void serveFile(WiFiClient &client, const char* filepath) {
    Serial.print("Attempting to serve: ");
    Serial.println(filepath);
    
    if (!SD.exists(filepath)) {
        Serial.println("File not found");
        serve404(client);
        return;
    }
    
    File file = SD.open(filepath);
    if (!file) {
        Serial.println("Failed to open");
        serve404(client);
        return;
    }
    
    Serial.print("File size: ");
    Serial.println(file.size());
    
    // Send HTTP headers
    client.println("HTTP/1.1 200 OK");
    
    if (String(filepath).endsWith(".html")) {
        client.println("Content-Type: text/html; charset=UTF-8");
    } else if (String(filepath).endsWith(".css")) {
        client.println("Content-Type: text/css");
    } else if (String(filepath).endsWith(".js")) {
        client.println("Content-Type: application/javascript");
    }
    
    client.println("Connection: close");
    client.println();  // ← CRITICAL: Blank line separates headers from body
    
    // Send file contents
    const size_t bufferSize = 512;
    uint8_t buffer[bufferSize];
    
    while (file.available()) {
        size_t len = file.read(buffer, bufferSize);
        client.write(buffer, len);
        delay(1);
    }
    
    file.close();
    Serial.println("File sent");
}

void serveStatus(WiFiClient &client) {
    unsigned long uptime = millis() / 1000;
    int hours = uptime / 3600;
    int mins = (uptime % 3600) / 60;
    
    String json = "{";
    json += "\"uptime\":\"" + String(hours) + "h " + String(mins) + "m\",";
    json += "\"freeHeap\":\"" + String(ESP.getFreeHeap() / 1024) + " KB\",";
    json += "\"totalHeap\":\"" + String(ESP.getHeapSize() / 1024) + " KB\",";
    json += "\"ramPercent\":" + String(100 - (ESP.getFreeHeap() * 100 / ESP.getHeapSize())) + ",";
    json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
    json += "\"mac\":\"" + WiFi.macAddress() + "\",";
    json += "\"ssid\":\"" + WiFi.SSID() + "\",";
    json += "\"rssi\":\"" + String(WiFi.RSSI()) + " dBm\",";
    json += "\"dnsRunning\":" + String(benOS_dnsServerRunning ? "true" : "false");
    json += "}";
    
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: application/json");
    client.println("Access-Control-Allow-Origin: *");
    client.println("Connection: close");
    client.println();
    client.println(json);
}

void serveCommand(WiFiClient &client, String path) {
    int cmdStart = path.indexOf("cmd=") + 4;
    String cmd = "";
    
    if (cmdStart > 3) {
        int cmdEnd = path.indexOf("&", cmdStart);
        if (cmdEnd < 0) cmdEnd = path.length();
        cmd = path.substring(cmdStart, cmdEnd);
        cmd.replace("%20", " ");
        cmd.replace("+", " ");
    }
    
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: text/plain");
    client.println("Access-Control-Allow-Origin: *");
    client.println("Connection: close");
    client.println();
    
    if (cmd.length() > 0) {
        // Add command to queue
        if (benOS_webCommandCount < MAX_WEB_COMMANDS) {
            benOS_webCommandQueue[benOS_webCommandCount++] = cmd;
            client.println("Command queued: " + cmd);
            client.println("Command will execute on device");
            Serial.println("Web command queued: " + cmd);
        } else {
            client.println("Error: Command queue full");
            Serial.println("Command queue full!");
        }
    } else {
        client.println("Error: No command");
    }
}

void serve404(WiFiClient &client) {
    client.println("HTTP/1.1 404 Not Found");
    client.println("Content-Type: text/html");
    client.println("Connection: close");
    client.println();
    client.println("<html><body style='background:#000;color:#0f0;font-family:monospace;'>");
    client.println("<h1>404 - Not Found</h1>");
    client.println("<a href='/' style='color:#0f0;'>Return Home</a>");
    client.println("</body></html>");
}

// ========== BUTTON WAIT HELPER ==========
void benOS_waitForButton() {
    while (digitalRead(PIN_KO) == LOW) {
        benOS_processWebServer();
        delay(10);
    }
    delay(200);
    
    int lastBtn = HIGH;
    while (true) {
        benOS_processWebServer();
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) break;
        lastBtn = btn;
        delay(50);
    }
    
    while (digitalRead(PIN_KO) == LOW) {
        benOS_processWebServer();
        delay(10);
    }
    delay(200);
}

// ========== MUSIC PLAYER ==========

void benOS_play(TFT_eSPI &tft) {
    // List WAV files from /sounds
    File root = SD.open("/sounds");
    if (!root || !root.isDirectory()) {
        benOS_clearScreen(tft);
        benOS_addLine("No /sounds folder found");
        benOS_redrawScreen(tft);
        return;
    }
    
    String files[30];
    int fileCount = 0;
    
    File file = root.openNextFile();
    while (file && fileCount < 30) {
        if (!file.isDirectory()) {
            String name = String(file.name());
            if (name.endsWith(".wav") || name.endsWith(".WAV")) {
                files[fileCount++] = name;
            }
        }
        file = root.openNextFile();
    }
    
    if (fileCount == 0) {
        benOS_clearScreen(tft);
        benOS_addLine("No .wav files in /sounds/");
        benOS_redrawScreen(tft);
        return;
    }
    
