bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
    // Select file
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Music Player");
            benOS_addLine("===================");
            benOS_addLine("");
            benOS_addLine("Select track:");
            
            int startIdx = selected - 4;
            if (startIdx < 0) startIdx = 0;
            if (startIdx > fileCount - 8) startIdx = fileCount - 8;
            if (fileCount < 8) startIdx = 0;
            
            for (int i = 0; i < 8 && (startIdx + i) < fileCount; i++) {
                int idx = startIdx + i;
                String line = (idx == selected) ? "> " : "  ";
                line += files[idx].substring(0, 35);
                benOS_addLine(line);
            }
            
            benOS_addLine("");
            benOS_addLine("Press button to play");
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= fileCount) selected = fileCount - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // Play selected file
            String filepath = "/sounds/" + files[selected];
            
            benOS_clearScreen(tft);
            benOS_addLine("Now Playing");
            benOS_addLine("===================");
            benOS_addLine("");
            benOS_addLine(files[selected]);
            benOS_addLine("");
            benOS_addLine("[♪♫♪♫♪♫♪♫♪♫]");
            benOS_addLine("");
            benOS_addLine("Press button to stop");
            benOS_redrawScreen(tft);
            
            playSound(filepath.c_str(), true);
            
            // Monitor playback
            extern AudioGeneratorWAV *wav;
            int lastBtnInner = HIGH;
            
            while (wav && wav->isRunning()) {
                updateAudio();
                
                // Check for button press to stop
                int btnInner = digitalRead(PIN_KO);
                if (btnInner == LOW && lastBtnInner == HIGH) {
                    stopAudio();
                    break;
                }
                lastBtnInner = btnInner;
                
                delay(10);
            }
            
            benOS_clearScreen(tft);
            benOS_addLine("Playback finished");
            benOS_redrawScreen(tft);
            delay(1000);
            
            return;
        }
        lastBtn = btn;
        delay(50);
    }
}

// ========== FART SOUND BOARD ==========

void benOS_fart(TFT_eSPI &tft) {
    // Check for fart sounds in /sounds/farts/
    File root = SD.open("/sounds/farts");
    if (!root || !root.isDirectory()) {
        benOS_clearScreen(tft);
        benOS_addLine("No /sounds/farts folder");
        benOS_addLine("");
        benOS_addLine("Create /sounds/farts/");
        benOS_addLine("Add fart sound WAV files:");
        benOS_addLine("  fart1.wav");
        benOS_addLine("  fart2.wav");
        benOS_addLine("  fart3.wav");
        benOS_addLine("  etc...");
        benOS_redrawScreen(tft);
        delay(2000);
        return;
    }
    
    String files[20];
    int fileCount = 0;
    
    File file = root.openNextFile();
    while (file && fileCount < 20) {
        if (!file.isDirectory()) {
            String name = String(file.name());
            if (name.endsWith(".wav") || name.endsWith(".WAV")) {
                files[fileCount++] = name;
            }
        }
        file = root.openNextFile();
    }
    
    if (fileCount == 0) {
        benOS_clearScreen(tft);
        benOS_addLine("No fart sounds found!");
        benOS_addLine("Add .wav files to:");
        benOS_addLine("/sounds/farts/");
        benOS_redrawScreen(tft);
        delay(2000);
        return;
    }
    
    // Display fart board
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    unsigned long btnHoldStart = 0;
    bool btnHeld = false;
    
    while (true) {
        if (selected != lastSelected) {
            tft.fillScreen(0x4208);  // Brown background
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(4);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("FART BOARD", 160, 10);
            
            tft.setTextFont(2);
            tft.setTextDatum(TL_DATUM);
            
            // Draw fart buttons in grid
            int cols = 3;
            int rows = (fileCount + cols - 1) / cols;
            int buttonW = 90;
            int buttonH = 40;
            int startX = 20;
            int startY = 60;
            
            for (int i = 0; i < fileCount && i < 12; i++) {
                int col = i % cols;
                int row = i / cols;
                int x = startX + col * (buttonW + 10);
                int y = startY + row * (buttonH + 10);
                
                if (i == selected) {
                    tft.fillRoundRect(x, y, buttonW, buttonH, 8, TFT_GREEN);
                    tft.setTextColor(TFT_BLACK, TFT_GREEN);
                } else {
                    tft.fillRoundRect(x, y, buttonW, buttonH, 8, 0x8410);
                    tft.setTextColor(TFT_WHITE, 0x8410);
                }
                
                tft.setTextDatum(MC_DATUM);
                String label = "Fart " + String(i + 1);
                tft.drawString(label, x + buttonW / 2, y + buttonH / 2);
            }
            
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(1);
            tft.setTextDatum(BC_DATUM);
            tft.drawString("Rotate=Select | Press=Play | Hold=Exit", 160, 230);
            
            lastSelected = selected;
        }
        
