bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= fileCount) selected = fileCount - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        
        // Detect button hold for exit
        if (btn == LOW && lastBtn == HIGH) {
            btnHoldStart = millis();
            btnHeld = false;
        }
        
        if (btn == LOW && millis() - btnHoldStart > 1000 && !btnHeld) {
            // Button held for 1 second - EXIT
            btnHeld = true;
            tft.fillScreen(0x4208);
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(2);
            tft.setTextDatum(MC_DATUM);
            tft.drawString("Exiting Fart Board...", 160, 120);
            delay(500);
            return;
        }
        
        if (btn == HIGH && lastBtn == LOW && !btnHeld) {
            // Quick press - play sound
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // Play selected fart sound
            String filepath = "/sounds/farts/" + files[selected];
            
            // Show playing animation
            tft.fillRect(0, 100, 320, 40, 0x4208);
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(4);
            tft.setTextDatum(MC_DATUM);
            tft.drawString("PFFFFFFFFFFT!", 160, 120);
            
            playSound(filepath.c_str(), true);
            
            // Wait for playback to finish
            extern AudioGeneratorWAV *wav;
            while (wav && wav->isRunning()) {
                updateAudio();
                delay(10);
            }
            
            delay(500);
            lastSelected = -1;  // Force redraw
        }
        
        lastBtn = btn;
        delay(50);
    }
}

// ========== TIMER / STOPWATCH ==========

void benOS_timer(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    const char* options[] = {"Stopwatch", "Timer 1 min", "Timer 3 min", "Timer 5 min", "Timer 10 min", "Custom Timer"};
    const int numOptions = 6;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Timer / Stopwatch");
            benOS_addLine("===================");
            benOS_addLine("");
            
            for (int i = 0; i < numOptions; i++) {
                String line = (i == selected) ? "> " : "  ";
                line += options[i];
                benOS_addLine(line);
            }
            
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= numOptions) selected = numOptions - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            if (selected == 0) {
                // STOPWATCH MODE
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(TC_DATUM);
                tft.drawString("STOPWATCH", 160, 10);
                
                unsigned long startTime = millis();
                bool running = true;
                int lastBtnInner = HIGH;
                
                while (running) {
                    unsigned long elapsed = millis() - startTime;
                    int minutes = elapsed / 60000;
                    int seconds = (elapsed / 1000) % 60;
                    int hundredths = (elapsed / 10) % 100;
                    
                    char timeStr[12];
                    sprintf(timeStr, "%02d:%02d.%02d", minutes, seconds, hundredths);
                    
                    tft.fillRect(0, 80, 320, 80, benOS_themes[benOS_currentTheme].bg);
                    tft.setTextFont(7);
                    tft.setTextDatum(MC_DATUM);
                    tft.drawString(String(timeStr), 160, 120);
                    
                    tft.setTextFont(2);
                    tft.setTextDatum(BC_DATUM);
                    tft.drawString("Press button to stop", 160, 220);
                    
                    // Check for button press
                    int btnInner = digitalRead(PIN_KO);
                    if (btnInner == LOW && lastBtnInner == HIGH) {
                        running = false;
                    }
                    lastBtnInner = btnInner;
                    
                    delay(10);
                }
                
                // Show final time
                tft.fillRect(0, 200, 320, 40, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.drawString("STOPPED - Press to continue", 160, 220);
                
                while (digitalRead(PIN_KO) == LOW) delay(10);
                delay(200);
                lastBtn = HIGH;
                while (true) {
                    int btn = digitalRead(PIN_KO);
                    if (btn == LOW && lastBtn == HIGH) break;
                    lastBtn = btn;
                    delay(50);
                }
                
                return;
                
            } else {
                // TIMER MODE
                int timerMinutes = 0;
                
                if (selected == 1) timerMinutes = 1;
                else if (selected == 2) timerMinutes = 3;
                else if (selected == 3) timerMinutes = 5;
                else if (selected == 4) timerMinutes = 10;
                else if (selected == 5) {
                    // Custom timer - use rotary to set
                    int customMin = 1;
                    int lastCustom = -1;
                    int lastRotaryCustom = rotaryPos;
                    int lastBtnCustom = HIGH;
                    
                    while (true) {
                        if (customMin != lastCustom) {
                            benOS_clearScreen(tft);
                            benOS_addLine("Set Timer Duration");
                            benOS_addLine("===================");
                            benOS_addLine("");
                            benOS_addLine("Minutes: " + String(customMin));
                            benOS_addLine("");
                            benOS_addLine("Rotate to adjust");
                            benOS_addLine("Press to start");
                            benOS_redrawScreen(tft);
                            lastCustom = customMin;
                        }
                        
                        int rotDiff = rotaryPos - lastRotaryCustom;
                        if (rotDiff > 2) {
                            customMin++;
                            if (customMin > 60) customMin = 60;
                            lastRotaryCustom = rotaryPos;
                        } else if (rotDiff < -2) {
                            customMin--;
                            if (customMin < 1) customMin = 1;
                            lastRotaryCustom = rotaryPos;
                        }
                        
                        int btnCustom = digitalRead(PIN_KO);
                        if (btnCustom == LOW && lastBtnCustom == HIGH) {
                            while (digitalRead(PIN_KO) == LOW) delay(10);
                            delay(200);
                            timerMinutes = customMin;
                            break;
                        }
                        lastBtnCustom = btnCustom;
                        delay(50);
                    }
                }
                
                // Run timer
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(TC_DATUM);
                tft.drawString("TIMER", 160, 10);
                
                unsigned long endTime = millis() + (timerMinutes * 60000);
                bool running = true;
                int lastBtnInner = HIGH;
                
                while (running && millis() < endTime) {
                    unsigned long remaining = endTime - millis();
                    int minutes = remaining / 60000;
                    int seconds = (remaining / 1000) % 60;
                    
                    char timeStr[8];
                    sprintf(timeStr, "%02d:%02d", minutes, seconds);
                    
                    tft.fillRect(0, 80, 320, 80, benOS_themes[benOS_currentTheme].bg);
                    tft.setTextFont(7);
                    tft.setTextDatum(MC_DATUM);
                    tft.drawString(String(timeStr), 160, 120);
                    
