bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                    // Progress bar
                    int barWidth = (int)(280 * (1.0 - (float)remaining / (timerMinutes * 60000)));
                    tft.fillRect(20, 180, barWidth, 20, TFT_GREEN);
                    tft.drawRect(20, 180, 280, 20, benOS_themes[benOS_currentTheme].fg);
                    
                    tft.setTextFont(2);
                    tft.setTextDatum(BC_DATUM);
                    tft.drawString("Press button to cancel", 160, 220);
                    
                    // Check for button press to cancel
                    int btnInner = digitalRead(PIN_KO);
                    if (btnInner == LOW && lastBtnInner == HIGH) {
                        running = false;
                        
                        benOS_clearScreen(tft);
                        benOS_addLine("Timer cancelled");
                        benOS_redrawScreen(tft);
                        delay(1000);
                        return;
                    }
                    lastBtnInner = btnInner;
                    
                    delay(100);
                }
                
                // Timer finished - alert!
                tft.fillScreen(TFT_RED);
                tft.setTextColor(TFT_WHITE, TFT_RED);
                tft.setTextFont(4);
                tft.setTextDatum(MC_DATUM);
                
                // Play alert sound if available
                if (SD.exists("/sounds/alert.wav")) {
                    playSound("/sounds/alert.wav", true);
                }
                
                // Flash display
                for (int i = 0; i < 10; i++) {
                    tft.fillScreen((i % 2 == 0) ? TFT_RED : TFT_YELLOW);
                    tft.setTextColor((i % 2 == 0) ? TFT_WHITE : TFT_BLACK, (i % 2 == 0) ? TFT_RED : TFT_YELLOW);
                    tft.drawString("TIME'S UP!", 160, 120);
                    delay(300);
                }
                
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(MC_DATUM);
                tft.drawString("Timer finished!", 160, 120);
                tft.drawString("Press button to continue", 160, 150);
                
                while (digitalRead(PIN_KO) == LOW) delay(10);
                delay(200);
                lastBtn = HIGH;
                while (true) {
                    int btn = digitalRead(PIN_KO);
                    if (btn == LOW && lastBtn == HIGH) break;
                    lastBtn = btn;
                    delay(50);
                }
                
                return;
            }
        }
        lastBtn = btn;
        delay(50);
    }
}

// ========== MAIN RUN FUNCTION ==========

void run_BenOS(TFT_eSPI &tft) {
    tft.setRotation(3);
    
    // Splash screen - draw directly to screen, not using buffer
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    tft.setTextFont(2);
    tft.setTextDatum(TL_DATUM);
    
    int y = 10;  // Start from top with padding
    
    // Simple BenOS logo
    tft.drawString(" ___             ___  ___ ", 10, y); y += 16;
    tft.drawString(" | _ )  ___ _ _/  _ \\/ __|", 10, y); y += 16;
    tft.drawString(" | _  \\/ -_)' \\|   (_) |\\__ \\", 10, y); y += 16;
    tft.drawString(" |___/\\___|_||_|\\___/|___/", 10, y); y += 16;
    
    y += 16;  // Extra space
    tft.drawString(BenOS_Config::OS_VERSION, 10, y); y += 16;
    tft.drawString("A Mini Terminal OS", 10, y); y += 16;
    
    y += 8;
    tft.drawString("Chip: ESP32-WROVER", 10, y); y += 16;
    tft.drawString("Features: WiFi, BT, Dual Core", 10, y); y += 16;
    tft.drawString("240MHz, 40MHz Crystal", 10, y); y += 16;
    tft.drawString("MAC: 10:97:bd:d1:f9:e4", 10, y); y += 16;
    
    y += 16;
    tft.setTextColor(TFT_YELLOW, benOS_themes[benOS_currentTheme].bg);
    tft.drawString("Press button to continue...", 10, y);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    
    // Wait for button to be RELEASED first (if pressed from menu)
    while (digitalRead(PIN_KO) == LOW) {
        delay(10);
    }
    delay(300);  // Debounce delay
    
    // Now wait for a fresh button press
    int lastBtn = HIGH;
    while (true) {
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            break;  // Button pressed!
        }
        lastBtn = btn;
        delay(50);
    }
    
    // Wait for button release
    while (digitalRead(PIN_KO) == LOW) {
        delay(10);
    }
    delay(200);  // Final debounce
        
// Main command loop
bool exitOS = false;
while (!exitOS) {
    // Process DNS requests in background
    benOS_processDNSRequest();
    
    // Process web server requests
    benOS_processWebServer();
    
    // Declare variables BEFORE any goto
    int cmdIdx = -1;
    String cmd = "";
    bool fromWeb = false;
    
    // ========== CHECK FOR WEB COMMANDS ========== 
if (benOS_webCommandCount > 0) {
    Serial.println("=== WEB COMMAND DETECTED ===");
    Serial.print("Queue count: ");
    Serial.println(benOS_webCommandCount);
    
    // Get the first command from queue
    String webCmd = benOS_webCommandQueue[0];
    Serial.print("Command: ");
    Serial.println(webCmd);
    
    // Shift queue down
    for (int i = 0; i < benOS_webCommandCount - 1; i++) {
        benOS_webCommandQueue[i] = benOS_webCommandQueue[i + 1];
    }
    benOS_webCommandCount--;
    
    // Find command index
    for (int i = 0; i < benOS_numCommands; i++) {
        if (String(benOS_commands[i]) == webCmd) {
            cmdIdx = i;
            Serial.print("Found command at index: ");
            Serial.println(cmdIdx);
            break;
        }
    }
    
    // Execute the web command
    if (cmdIdx >= 0) {
        Serial.println("Executing web command...");
        benOS_lastSelectedCommand = cmdIdx;
        cmd = benOS_commands[cmdIdx];
        fromWeb = true;
        
        // Clear output buffer
        benOS_webCommandOutput = "";
        benOS_webCommandDone = false;
        
        benOS_clearScreen(tft);
        benOS_addLine("[WEB] > " + cmd);
        
        // Jump to command execution
        goto execute_command;
    } else {
        Serial.println("ERROR: Command not found in command list!");
    }
}

// Get command from menu
cmdIdx = benOS_selectCommand(tft);

// If -1, it means a web command is waiting, loop back to check it
if (cmdIdx == -1) {
    continue;  // Skip to next iteration of while (!exitOS)
}

cmd = benOS_commands[cmdIdx];

