bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
execute_command:
    
    if (!fromWeb) {
        benOS_clearScreen(tft);
        benOS_addLine("> " + cmd);
    }
        
if (cmd == "help") {
            benOS_showHelp(tft);
        }
        else if (cmd == "version") {
            benOS_addLine(BenOS_Config::OS_VERSION);
            benOS_redrawScreen(tft);
        }
        else if (cmd == "time") {
            benOS_addLine(benOS_getTime());
            benOS_redrawScreen(tft);
        }
        else if (cmd == "synctime") {
            if (benOS_ensureWiFi(tft)) {
                benOS_clearScreen(tft);
                benOS_addLine("> synctime");
                benOS_syncTime(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "wifi") {
            benOS_connectWiFi(tft);
        }
        else if (cmd == "wifiscan") {
            benOS_wifiScan(tft);
        }
        else if (cmd == "sysinfo") {
            benOS_sysinfo(tft);
        }
        else if (cmd == "ping") {
            if (benOS_ensureWiFi(tft)) {
                String host = benOS_selectPingHost(tft);
                if (host.length() > 0) {
                    benOS_ping(tft, host);
                }
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "speedtest") {
            if (benOS_ensureWiFi(tft)) {
                benOS_speedtest(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "passgen") {
            benOS_passgen(tft);
        }
        else if (cmd == "qrcode") {
            benOS_qrcode(tft);
        }
        else if (cmd == "ascii") {
            benOS_ascii(tft);
        }
        else if (cmd == "cowsay") {
            benOS_cowsay(tft);
        }
        else if (cmd == "weather") {
            if (benOS_ensureWiFi(tft)) {
                benOS_weather(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "stocks") {
            if (benOS_ensureWiFi(tft)) {
                benOS_stocks(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "news") {
            if (benOS_ensureWiFi(tft)) {
                benOS_news(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "webserver") {
            if (benOS_ensureWiFi(tft)) {
                benOS_webserver(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "play") {
            benOS_play(tft);
        }
        else if (cmd == "fart") {
            benOS_fart(tft);
        }
        else if (cmd == "timer") {
            benOS_timer(tft);
        }
        else if (cmd == "dig") {
            if (benOS_ensureWiFi(tft)) {
                String hostname = benOS_hostnameInput(tft);
                if (hostname.length() > 0) {
                    benOS_dig(tft, hostname);
                }
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "curl") {
            if (benOS_ensureWiFi(tft)) {
                String url = benOS_urlInput(tft);
                if (url.length() > 0) {
                    benOS_clearScreen(tft);
                    benOS_addLine("> curl " + url);
                    benOS_curl(tft, url);
                }
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "calc") {
            String expr = benOS_textInput(tft, "Enter expression:");
            if (expr.length() > 0) {
                benOS_clearScreen(tft);
                benOS_addLine("> calc " + expr);
                benOS_calc(tft, expr);
            }
        }
        else if (cmd == "write") {
            String filename = benOS_textInput(tft, "Filename:");
            if (filename.length() > 0) {
                String data = benOS_textInput(tft, "Data:");
                if (data.length() > 0) {
                    benOS_clearScreen(tft);
                    benOS_writeFile(tft, filename, data);
                }
            }
        }
        else if (cmd == "read") {
            String filename = benOS_textInput(tft, "Filename:");
            if (filename.length() > 0) {
                benOS_clearScreen(tft);
                benOS_readFile(tft, filename);
            }
        }
        else if (cmd == "delete") {
            String filename = benOS_textInput(tft, "Filename:");
            if (filename.length() > 0) {
                benOS_clearScreen(tft);
                benOS_deleteFile(tft, filename);
            }
        }
        else if (cmd == "ls") {
            benOS_listFiles(tft);
        }
        else if (cmd == "image") {
            benOS_showImage(tft, "/ben.jpg");
            benOS_clearScreen(tft);
        }
        else if (cmd == "themes") {
            benOS_selectTheme(tft);
            benOS_clearScreen(tft);
            benOS_addLine("Theme changed!");
            benOS_redrawScreen(tft);
        }
        else if (cmd == "dnsstart") {
            benOS_startDNSServer(tft);
        }
        else if (cmd == "dnsstop") {
            benOS_stopDNSServer(tft);
        }
        else if (cmd == "dnsstatus") {
            benOS_dnsServerStatus(tft);
        }
        else if (cmd == "clear") {
            benOS_clearScreen(tft);
        }
        else if (cmd == "exit") {
            exitOS = true;
            benOS_lastSelectedCommand = 0;
            break;
        }

        // ========== CAPTURE OUTPUT FOR WEB COMMANDS ==========
        if (fromWeb) {
            // Copy display buffer to web output
            benOS_webCommandOutput = "";
            for (int i = 0; i < benOS_totalLines && i < BENOS_MAX_LINES; i++) {
                benOS_webCommandOutput += benOS_displayBuffer[i] + "\n";
            }
            benOS_webCommandDone = true;
        }
        
        if (!exitOS && cmd != "image" && cmd != "themes" && cmd != "play" && cmd != "fart" && cmd != "timer" && cmd != "ascii" && cmd != "cowsay" && cmd != "qrcode" && cmd != "webserver" && !fromWeb) {
            benOS_addLine("");
            benOS_addLine("Press button to continue...");
            benOS_redrawScreen(tft);
            
            benOS_waitForButton();
        }
        
    }  // ← Close while (!exitOS) loop
    
    tft.fillScreen(TFT_BLACK);
}  // ← Close run_BenOS() function

#endif // BENOS_H